Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFE100.atdf
         <register caption="Interrupt Vector Address Offset Registe" name="OFF147" offset="0x78c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF148" offset="0x790" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF149" offset="0x794" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF150" offset="0x798" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF153" offset="0x7a4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF154" offset="0x7a8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF155" offset="0x7ac" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF156" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF157" offset="0x7b4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF158" offset="0x7b8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF159" offset="0x7bc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF160" offset="0x7c0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF161" offset="0x7c4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF162" offset="0x7c8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF163" offset="0x7cc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF164" offset="0x7d0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF165" offset="0x7d4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF166" offset="0x7d8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF167" offset="0x7dc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF168" offset="0x7e0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF169" offset="0x7e4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF170" offset="0x7e8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF171" offset="0x7ec" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF172" offset="0x7f0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF173" offset="0x7f4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF174" offset="0x7f8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF175" offset="0x7fc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF176" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF177" offset="0x804" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF178" offset="0x808" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF179" offset="0x80c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF180" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF181" offset="0x814" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
