Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFE100.atdf
         <register caption="USB Indexed Endpoint Control Status Register 2 (Endpoint 1-7)" name="USBIENCSR2" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT"/>
            <bitfield mask="0x000F0000" name="TEP"/>
            <bitfield caption="TX Endpoint Protocol Control bits" mask="0x00300000" name="PROTOCOL" values="USBIENCSR2__PROTOCOL"/>
            <bitfield caption="TX Endpoint Operating Speed Control bits (" mask="0x00C00000" name="SPEED" values="USBIENCSR2__SPEED"/>
            <bitfield mask="0xFF000000" name="TXINTERV"/>
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 3 (Endpoint 0)" name="USBIE0CSR3" offset="0x1c" rw="R" size="4">
            <bitfield mask="0x01000000" name="UTMIDWID"/>
            <bitfield caption="Soft Connect/Disconnect Option bit" mask="0x02000000" name="SOFTCONE" values="USBIE0CSR3__SOFTCONE"/>
            <bitfield caption="Dynamic FIFO Sizing Option bit" mask="0x04000000" name="DYNFIFOS" values="USBIE0CSR3__DYNFIFOS"/>
            <bitfield caption="High-bandwidth TX ISO Option bit" mask="0x08000000" name="HBTXEN" values="USBIE0CSR3__HBTXEN"/>
            <bitfield caption="High-bandwidth RX ISO Option bit" mask="0x10000000" name="HBRXEN" values="USBIE0CSR3__HBRXEN"/>
            <bitfield caption="Byte Ordering Option bit" mask="0x20000000" name="BIGEND" values="USBIE0CSR3__BIGEND"/>
            <bitfield caption="Automatic Splitting Option bit" mask="0x40000000" name="MPTXEN" values="USBIE0CSR3__MPTXEN"/>
            <bitfield caption="Automatic Amalgamation Option bit" mask="0x80000000" name="MPRXEN" values="USBIE0CSR3__MPRXEN"/>
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 3 (Endpoint 1-7)" name="USBIENCSR3" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP"/>
            <bitfield caption="RX Endpoint Protocol Control bits" mask="0x00000030" name="PROTOCOL" values="USBIENCSR3__PROTOCOL"/>
            <bitfield caption="RX Endpoint Operating Speed Control bits" mask="0x000000C0" name="SPEED" values="USBIENCSR3__SPEED"/>
            <bitfield mask="0x0000FF00" name="RXINTERV"/>
            <bitfield caption="Transmit FIFO Size bits" mask="0x0F000000" name="TXFIFOSZ" values="USBIENCSR3__TXFIFOSZ"/>
            <bitfield caption="Receive FIFO Size bits" mask="0xF0000000" name="RXFIFOSZ" values="USBIENCSR3__RXFIFOSZ"/>
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO0" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO1" offset="0x24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO2" offset="0x28" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO3" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO4" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="USB OTG Control/Status Register" name="USBOTG" offset="0x60" rw="RW" size="4">
            <bitfield caption="Active Session Control/Status bit" mask="0x00000001" name="SESSION" values="USBOTG__SESSION"/>
            <bitfield caption="Host Request Control bit" mask="0x00000002" name="HOSTREQ" values="USBOTG__HOSTREQ"/>
            <bitfield caption="Host Mode bit" mask="0x00000004" name="HOSTMODE" values="USBOTG__HOSTMODE"/>
            <bitfield caption="Vbus Level Detection bits" mask="0x00000018" name="VBUS" values="USBOTG__VBUS"/>
            <bitfield caption="Low-Speed Device Detection bit" mask="0x00000020" name="LSDEV" values="USBOTG__LSDEV"/>
            <bitfield caption="Full-Speed/Hi-Speed device detection bit (" mask="0x00000040" name="FSDEV" values="USBOTG__FSDEV"/>
            <bitfield caption="USB Device Type bit" mask="0x00000080" name="BDEV" values="USBOTG__BDEV"/>
            <bitfield caption="RX Endpoint DMA Assertion Control bit" mask="0x00000100" name="RXEDMA" values="USBOTG__RXEDMA"/>
            <bitfield caption="TX Endpoint DMA Assertion Control bit" mask="0x00000200" name="TXEDMA" values="USBOTG__TXEDMA"/>
            <bitfield caption="TX Endpoint FIFO packet size bits" mask="0x000F0000" name="TXFIFOSZ" values="USBOTG__TXFIFOSZ"/>
            <bitfield caption="TX Endpoint Double-packet Buffering Control bit" mask="0x00100000" name="TXDPB" values="USBOTG__TXDPB"/>
            <bitfield caption="RX Endpoint FIFO Packet Size bits" mask="0x0F000000" name="RXFIFOSZ" values="USBOTG__RXFIFOSZ"/>
            <bitfield caption="RX Endpoint Double-packet Buffering Control bit" mask="0x10000000" name="RXDPB" values="USBOTG__RXDPB"/>
         </register>
         <register caption="USB Hardware Version Register" name="USBHWVER" offset="0x6c" rw="R" size="4">
            <bitfield mask="0x000003FF" name="VERMINOR"/>
            <bitfield mask="0x00007C00" name="VERMAJOR"/>
            <bitfield caption="Release Candidate bit" mask="0x00008000" name="RC" values="USBHWVER__RC"/>
         </register>
         <register caption="USB Information Register" name="USBINFO" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TXENDPTS"/>
            <bitfield mask="0x000000F0" name="RXENDPTS"/>
            <bitfield mask="0x00000F00" name="RAMBITS"/>
            <bitfield mask="0x0000F000" name="DMACHANS"/>
            <bitfield mask="0x000F0000" name="WTID"/>
            <bitfield mask="0x00F00000" name="WTCON"/>
            <bitfield mask="0xFF000000" name="VPLEN"/>
         </register>
